def get_data(data): # 사용자가 입력한 정보를 list 형태로 반환하는 함수
  new_data = []

  value_set = [
      {"1" : "멜로/로맨스",
        "2" : "코미디",
        "3" : "액션",
        "4" : "공포(호러)",
        "5" : "판타지/SF"},

       {"1" : [range(2016,2021)],
        "2" : [range(2011,2016)],
        "3" : [range(2006,2011)],
        "4" : [range(2000,2006)]},

      {"1" : "돈",
        "2" : "로봇",
        "3" : "동물",
        "4" : "총"},
      
      {"1" : "도시",
        "2" : "시골",
        "3" : "산",
        "4" : "국내"},
      
       {"1" : "잠",
        "2" : "노래",
        "3" : "음식",
        "4" : "바다"},
      
       {"1" : "짜장면",
        "2" : "피자",
        "3" : "치킨",
        "4" : "햄버거"}, 
      
       {"1" : "한국",
        "2" : "미국",
        "3" : "일본",
        "4" : "프랑스"}]

  for i in range(len(data)):
     new_data.append(value_set[i][data[i]])
  print(new_data)